app/views/comments/_comment.html.erb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "jjj"], ["created_at", 2016-10-25 03:12:11 UTC], ["updated_at", 2016-10-25 03:12:11 UTC]]
---
 <p><strong>
   Posted <%= time_ago_in_words(comment.created_at) %>