app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    #@comment = Comment.new(comment_params)
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "This is great!"], ["created_at", 2016-09-06 16:43:32 UTC], ["updated_at", 2016-09-06 16:43:32 UTC]]